DataProcessors/УправлениеЛицензированием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>УправлениеЛицензированием</Name>
			<Comment>Управление лицензированием</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Comment>Описание ошибки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Comment>Код ошибки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСтарта</Name>
					<Comment>Режим старта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинКод</Name>
					<Comment>Пин-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СигнатураОборудования</Name>
					<Comment>Сигнатура оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОборудования</Name>
					<Comment>Описание оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАктивации</Name>
					<Comment>Вариант активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Comment>Электронная почта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветИнтернетАктивации</Name>
					<Comment>Ответ интернет активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОтвет</Name>
					<Comment>Переключатель запрос или ответ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокЗапросаТелефоннойАктивации</Name>
					<Comment>Строка запроса телефонной активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>58</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации1</Name>
					<Comment>Блок ответа телефонной активации 1</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации2</Name>
					<Comment>Блок ответа телефонной активации 2</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации3</Name>
					<Comment>Блок ответа телефонной активации 3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключитьсяКВыбранномуСерверуПослеАктивации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерПакетаЛицензий</Name>
					<Comment>Регистрационный номер пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПакетаЛицензий</Name>
					<Comment>Пароль пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАктивации</Name>
					<Comment>Способ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКлюча</Name>
					<Comment>Номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомерКлюча</Name>
					<Comment>Заводской номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установщик</Name>
					<Comment>Установщик</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступаКлючаЗащиты</Name>
					<Comment>Код доступа ключа защиты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/УправлениеЛицензированием/Forms/ФормаАктивацииКлючаЗащиты/Ext/Form/Module.bsl
/////////////////////////////////////////////////////////////
// ОБРАБТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресСервера = ЛицензированиеСервер.АдресСервераЛицензирования();
    ТекущийАдресСервера = АдресСервера;
	
	Если НЕ ЗначениеЗаполнено(АдресСервера) Тогда
		Объект.РежимСтарта = 0;
		Объект.АдресСервера = "*LOCAL";
		Элементы.АдресСервера.Доступность = Ложь;
	ИначеЕсли ВРег(АдресСервера) = "*LOCAL" ИЛИ ВРег(АдресСервера) = "LOCALHOST" Тогда
		Объект.РежимСтарта = 0;
		Объект.АдресСервера = АдресСервера;
		Элементы.АдресСервера.Доступность = Ложь;
	ИначеЕсли  ВРег(АдресСервера) = "*AUTO" Тогда
		Объект.РежимСтарта = 1;
		Объект.АдресСервера = "";
	Иначе
		Объект.РежимСтарта = 1;
		Объект.АдресСервера = АдресСервера;
	КонецЕсли;
	
	СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
	КоличествоРешений = СписокРешений.Количество();
	
	Если КоличествоРешений > 1 Тогда // Несколько решений
		СписокВыбораРешений = Элементы.ВыбранноеРешение.СписокВыбора;
		ИндексРешения = 0;
		Для Каждого ЭлементСписка Из СписокРешений Цикл
			СписокВыбораРешений.Добавить(ИндексРешения, ЭлементСписка.Значение);
			ИндексРешения = ИндексРешения + 1;
		КонецЦикла;
	КонецЕсли;
	
	ВыбранноеРешение = 0;

	Настройки = ХранилищеОбщихНастроек.Загрузить("РегистрационнаяИнформация",,,"");
	Если Не Настройки = Неопределено Тогда
		Для Каждого Настройка Из Настройки Цикл
			Объект[Настройка.Ключ] = Настройка.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяОбработкиПоИндексу(Индекс)
	СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
	ТекИндекс = 0;
	Для Каждого ЭлементСписка Из СписокРешений Цикл
		Если ТекИндекс = Индекс Тогда
			Возврат ЭлементСписка.Ключ;
		Иначе
			ТекИндекс = ТекИндекс + 1;
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	ПереходКСтранице(Элементы.СтраницаВыборСервера);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);

	Если ПустаяСтрока(СтрЗаменить(Объект.ПинКод,"-","")) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указан пин-код!";
		Сообщение.Поле = "Объект.ПинКод";
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		
		Если (РежимАктивации = 0 И СтрДлина(СокрЛП(Объект.ПинКод)) < 7) ИЛИ (РежимАктивации = 1 И СтрДлина(СокрЛП(Объект.ПинКод)) < 23) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Неверно указан пин-код!";
			Сообщение.Поле = "Объект.ПинКод";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли;
	
	Если РежимАктивации = 0 Тогда //  Рег. номер нужен для НЕ совместных продуктов
		Если ПустаяСтрока(Объект.РегистрационныйНомер) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не указан регистрационный номер!";
			Сообщение.Поле = "Объект.РегистрационныйНомер";
			Сообщение.Сообщить();
			Отказ = Истина;
		Иначе
			Если СтрДлина(СокрЛП(Объект.РегистрационныйНомер)) < 13 Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Некорректно указан регистрационный номер!
				|Номер должен соджержать не менее 13 цифр";
				Сообщение.Поле = "Объект.РегистрационныйНомер";
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура КомандаВперед(Команда)
	ОбработкаДействия("Вперед");
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	ОбработкаДействия("Назад");
КонецПроцедуры

&НаКлиенте
Процедура КомандаАктивироватьВручную(Команда)
	
	Файл = Новый Файл(ИмяФайлаОтветаАктивации);
	Если НЕ Файл.Существует() Тогда
		Сообщить("Указанный файл не существует!");
		Возврат;
	КонецЕсли;
	Файл.ПолучитьТолькоЧтение();
	ПотокЧтения = Новый ТекстовыйДокумент();
	ПотокЧтения.Прочитать(ИмяФайлаОтветаАктивации,КодировкаТекста.ANSI);
	ТекстОтвета = ПотокЧтения.ПолучитьТекст();
	Результат = ЛицензированиеСервер.АктивироватьПрограммныйКлючНаУказанномСервере(Объект.АдресСервера, ТекстОтвета, ОписаниеОшибки);
	
	Если НЕ Результат Тогда
		Сообщить(ОписаниеОшибки);
	Иначе
		Если СервераРазличаются() Тогда
			ПереходКСтранице(Элементы.СтраницаДействияПослеАктивации);
		Иначе
			ЭтаФорма.Закрыть(ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаАктивироватьВебСервис(Команда)
	
	КодированнаяСтрока = СформироватьЗапросАктивации();
	Если КодированнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);
	
	Если ИмяМакетаПараметровЛицензирования = Неопределено Тогда
		ОписаниеОшибки = "Неверный формат имени обработки:"+Символы.ПС+Объект.ИмяОбработки;
		Сообщить(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Если РежимАктивации = 0 Тогда
		ОтветАктивации = ЛицензированиеСервер.АктивироватьЧерезВебСервис(КодированнаяСтрока, 0, ИмяМакетаПараметровЛицензирования, ОписаниеОшибки);
	Иначе
		ОтветАктивации = ЛицензированиеСервер.АктивироватьЧерезВебСервис(КодированнаяСтрока, 2, ИмяМакетаПараметровЛицензирования, ОписаниеОшибки);
	КонецЕсли;
	
	Если ОтветАктивации = "" Тогда
		ЭтаФорма.Закрыть(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Результат = ЛицензированиеСервер.АктивироватьПрограммныйКлючНаУказанномСервере(Объект.АдресСервера, ОтветАктивации, ОписаниеОшибки);
	Если НЕ Результат Тогда
		Сообщить(ОписаниеОшибки);
	Иначе
		Если СервераРазличаются() Тогда
			ПереходКСтранице(Элементы.СтраницаДействияПослеАктивации);
		Иначе
			ЭтаФорма.Закрыть(ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаАктивироватьПоТелефону(Команда)
	Перем ЯдроКлюча;
	Если ПустаяСтрока(СтрЗаменить(Объект.БлокОтветаТелефоннойАктивации1,"-","")) Тогда
		Сообщить("Заполните ответную строку активации");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрЗаменить(Объект.БлокОтветаТелефоннойАктивации2,"-","")) Тогда
		Сообщить("Заполните ответную строку активации");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрЗаменить(Объект.БлокОтветаТелефоннойАктивации3,"-","")) Тогда
		Сообщить("Заполните ответную строку активации");
		Возврат;
	КонецЕсли;
	
	ЯдроКлюча = "";
	
	ОписаниеОшибки = "";
	ДанныеАктивации = Новый Структура("ПредставлениеПинКода, ОписаниеОборудования, РегистрационныйНомер, ФИО, Организация, Телефон, Почта, Сайт, Установщик",
	Объект.ПинКод, Объект.ОписаниеОборудования, Объект.РегистрационныйНомер, Объект.Ответственный, Объект.Организация, Объект.Телефон, Объект.ЭлектроннаяПочта, Объект.Сайт, "");
	
	ОтветАктивации = Объект.БлокОтветаТелефоннойАктивации1 + Символы.ПС;
	ОтветАктивации = ОтветАктивации + Объект.БлокОтветаТелефоннойАктивации2 + Символы.ПС;
	ОтветАктивации = ОтветАктивации + Объект.БлокОтветаТелефоннойАктивации3 + Символы.ПС;
	
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	Если НЕ ЛицензированиеСервер.АктивироватьКлючПоТелефону(ИмяМакетаПараметровЛицензирования, Объект.АдресСервера, ОтветАктивации, ДанныеАктивации, ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
	Иначе
		Если СервераРазличаются() Тогда
			ПереходКСтранице(Элементы.СтраницаДействияПослеАктивации);
		Иначе
			ЭтаФорма.Закрыть(ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьФайл(Команда)
	
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
    РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Сохраненить файл запроса активации как";
	Диалог.Фильтр = "Файлы *.txt|*.txt";
	
	Если РежимАктивации = 0 Тогда
		Диалог.ПолноеИмяФайла = "KAR" + Объект.РегистрационныйНомер + ".txt";
	Иначе
		ЧастьКода = СтрЗаменить(Лев(Объект.ПинКод, 7),"-","");
		Диалог.ПолноеИмяФайла = "KAR" + ЧастьКода + ".txt";
	КонецЕсли;
			
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Файл = Новый ТекстовыйДокумент();
	Файл.Записать(ИмяФайла, КодировкаТекста.ANSI);
	
	КодированнаяСтрока = СформироватьЗапросАктивации();
	
	Если КодированнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Файл.УстановитьТекст(КодированнаяСтрока);
	Файл.Записать(ИмяФайла, КодировкаТекста.ANSI);
	
	//ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	
	ТекстПредупреждения = "Запрос активации сохранён в файл: " + ИмяФайла +".
	|Отправьте этот файл по электронной почте на адрес """ + ЛицензированиеСервер.АдресЭлектроннойПочтыДляАктивации(ИмяМакетаПараметровЛицензирования) + """,
	|получите ответ и загрузите его на странице загрузки ответа активации";
	Предупреждение(ТекстПредупреждения,,"Создан файл запроса активации");
	
	ПереходКСтранице(Элементы.СтраницаОтветАктивации);
КонецПроцедуры

////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

// Выбор файла ответа активации
&НаКлиенте
Процедура ИмяФайлаОтветаАктивацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	Если РасширениеПодключено Тогда
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.МножественныйВыбор = Ложь;
		ВыборФайла.Заголовок = НСтр("ru = 'Выбор файла'");
		ВыборФайла.Фильтр = НСтр("ru = 'Текстовый документ(*.txt)|*.txt|Все файлы (*.*)|*.*'");
		ВыборФайла.ИндексФильтра = 0;
		Результат = ВыборФайла.Выбрать();
		ПолноеИмяФайла = ВыборФайла.ПолноеИмяФайла;
		
		Если НЕ Результат Тогда
			Возврат;
		КонецЕсли;
		
		ИмяФайлаОтветаАктивации = ПолноеИмяФайла;
	Иначе
		ОписаниеОшибки = "Ошибка открытия файла. Попробуйте открыть через тонкий или толстый клиент.";
	КонецЕсли;
КонецПроцедуры


// Обработка действий пользователя
&НаКлиенте
Процедура ОбработкаДействия(Действие)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВыборСервера Тогда
		Если Объект.РежимСтарта = 1 Тогда
			Если ПустаяСтрока(Объект.АдресСервера) ИЛИ ВРег(Объект.АдресСервера) = "*AUTO" Тогда
				Сообщить("Укажите адрес сервера лицензирования");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если КоличествоРешений = 1 Тогда
			Объект.ИмяОбработки = ПолучитьИмяОбработкиПоИндексу(0);
			ПереходКСтранице(Элементы.СтраницаВариантАктивации);
		Иначе
			ПереходКСтранице(Элементы.СтраницаВыборРешения);
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВыборРешения Тогда
		
		Если Действие =  "Вперед" Тогда
			Объект.ИмяОбработки = ПолучитьИмяОбработкиПоИндексу(ВыбранноеРешение);
			ПереходКСтранице(Элементы.СтраницаВариантАктивации);
		Иначе
			ПереходКСтранице(Элементы.СтраницаВыборСервера);
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВариантАктивации Тогда
		Если Действие = "Вперед" Тогда
			
			ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
			Если ИмяМакетаПараметровЛицензирования = Неопределено Тогда
				ОписаниеОшибки = "Неверный формат имени обработки:"+Символы.ПС+Объект.ИмяОбработки;
				Сообщить(ОписаниеОшибки);
				Возврат;
			КонецЕсли;	
			
			Если Объект.ВариантАктивации = 0 Тогда //веб-сервис
				
				Если ЛицензированиеСервер.РазрешенаАктивацияЧерезВебСервис(ИмяМакетаПараметровЛицензирования) Тогда
					ПереходКСтранице(Элементы.СтраницаАктивацияПараметры);
				Иначе
					Сообщить("Для этой конфигурации отсутствует возможность активации через интернет");
					Возврат;
				КонецЕсли;
			ИначеЕсли Объект.ВариантАктивации = 1 Тогда //вручную через интернет
				Если ЛицензированиеСервер.РазрешенаАктивацияПоПочте(ИмяМакетаПараметровЛицензирования) Тогда
					ПереходКСтранице(Элементы.СтраницаЗапросОтвет);
				Иначе
					Сообщить("Для этой конфигурации отсутствует возможность активации через файловый запрос");
					Возврат;
				КонецЕсли;
			Иначе // по телефону
				Если ЛицензированиеСервер.РазрешенаАктивацияПоТелефону(ИмяМакетаПараметровЛицензирования) Тогда
					ПереходКСтранице(Элементы.СтраницаАктивацияПараметры);
				Иначе
					Сообщить("Для этой конфигурации отсутствует возможность активации по телефону");
					Возврат;
				КонецЕсли;
			КонецЕсли;
		Иначе //Назад
			Если КоличествоРешений = 1 Тогда
				ПереходКСтранице(Элементы.СтраницаВыборСервера);
			Иначе
				ПереходКСтранице(Элементы.СтраницаВыборРешения);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗапросОтвет Тогда
		Если Действие = "Вперед" Тогда
			//Вперёд
			Если Объект.ЗапросОтвет = 0 Тогда
				ПереходКСтранице(Элементы.СтраницаАктивацияПараметры);
			Иначе
				ПереходКСтранице(Элементы.СтраницаОтветАктивации);
			КонецЕсли;
		Иначе
			//Назад
			ПереходКСтранице(Элементы.СтраницаВариантАктивации);
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаАктивацияПараметры Тогда
		Если Действие = "Вперед" Тогда
			
			Если НЕ ПроверитьЗаполнение() Тогда
				Возврат;
			КонецЕсли;

			Если НЕ ЛицензированиеСервер.ПолучитьСигнатуруОборудованияУказанногоСервера(Объект.АдресСервера, Объект.СигнатураОборудования, Объект.ОписаниеОборудования, ОписаниеОшибки) Тогда	
				Сообщить("Не удалось получить идентификатор аппаратной привязки. " + ОписаниеОшибки);
				Возврат;
			КонецЕсли;
			
			ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
			РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);

			Если РежимАктивации = 0 Тогда
				РезультатПроверкиПинКода = ЛицензированиеСервер.ЭтоПинКод(Объект.ПинКод, ОписаниеОшибки);
			Иначе
				РегистрационныйНомер = "";
				КороткийПинКод = "";	
				РезультатПроверкиПинКода = ЛицензированиеСервер.ЭтоДлинныйПинКод(Объект.ПинКод, РегистрационныйНомер, КороткийПинКод, ОписаниеОшибки);
			КонецЕсли;
			
			Если РезультатПроверкиПинКода = Неопределено Тогда
				Сообщить(ОписаниеОшибки);
				Возврат;
			ИначеЕсли (НЕ РезультатПроверкиПинКода) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Некорректно указан пин-код!";
				Сообщение.Поле = "Объект.ПинКод";
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
							
			Если Объект.ВариантАктивации = 0 Тогда
				ПереходКСтранице(Элементы.СтраницаАктивацияВебСервис);
			ИначеЕсли Объект.ВариантАктивации = 1 Тогда //файл
				ПереходКСтранице(Элементы.СтраницаАктивацияФайл);
			Иначе //телефон
				Объект.БлокЗапросаТелефоннойАктивации = СформироватьЗапросТелефоннойАктивации();
				ТекстИнструкцииПоАктивации = "Позвоните в центр лицензирования по телефону """ + ЛицензированиеСервер.ТелефонЦентраЛицензирования(ИмяМакетаПараметровЛицензирования) + """.
				|Продиктуйте регистрацонные данные и запрос активации ключа.
				|Затем, перейдите на следующую страницу и введите ответ активации ключа.";
				Элементы.ДекорацияИнструкцияПоАктивации.Заголовок = ТекстИнструкцииПоАктивации;
				ПереходКСтранице(Элементы.СтраницаЗапросАктивацииТелефон);
			КонецЕсли;
		Иначе
			ПереходКСтранице(Элементы.СтраницаВариантАктивации);
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаАктивацияФайл Тогда
		Если Действие = "Назад" Тогда
			ПереходКСтранице(Элементы.СтраницаАктивацияПараметры);
		Иначе
			ПереходКСтранице(Элементы.СтраницаОтветАктивации);
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтветАктивации Тогда
		Если Действие = "Назад" Тогда
			Если Объект.ЗапросОтвет = 0 Тогда
				ПереходКСтранице(Элементы.СтраницаАктивацияФайл);
			Иначе
				ПереходКСтранице(Элементы.СтраницаЗапросОтвет);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаАктивацияВебСервис Тогда
		Если Действие = "Назад" Тогда
			ПереходКСтранице(Элементы.СтраницаАктивацияПараметры);
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗапросАктивацииТелефон Тогда
		Если Действие = "Вперед" Тогда
			ПереходКСтранице(Элементы.СтраницаАктивацияТелефон);
		Иначе //назад
			ПереходКСтранице(Элементы.СтраницаАктивацияПараметры);
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаАктивацияТелефон Тогда
		Если Действие = "Назад" Тогда
			ПереходКСтранице(Элементы.СтраницаЗапросАктивацииТелефон);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Переход к странице формы
// Параметры
//   Страница - ГруппаФормы - страница, на которую будет осуществлён переход
&НаКлиенте
Процедура ПереходКСтранице(Страница)
	Для Каждого ТекСтраница Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
		ТекСтраница.Видимость = Ложь;
	КонецЦикла;
	Страница.Видимость = Истина;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
	
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если  ТекущаяСтраница = Элементы.СтраницаВыборСервера Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаКомандаНазад.Доступность = Ложь;
	Иначе
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаКомандаНазад.Доступность = Истина;
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаАктивацияВебСервис ИЛИ ТекущаяСтраница = Элементы.СтраницаОтветАктивации ИЛИ ТекущаяСтраница = Элементы.СтраницаАктивацияТелефон Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаКомандаВперед.Доступность = Ложь;
	Иначе
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаКомандаВперед.Доступность = Истина;
	КонецЕсли;
	
	Если Страница = Элементы.СтраницаАктивацияПараметры Тогда
		ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
		Если ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования) = 0 Тогда
			Элементы.ПинКод.Маска = "999-999";
			Элементы.ПинКод.Ширина = 9;
			Элементы.РегистрационныйНомер.Видимость = Истина;
			Элементы.НадписьРегистрационныйНомер.Видимость = Истина;
		Иначе
			Элементы.ПинКод.Маска = "999-999-999-999-999-999";
			Элементы.ПинКод.Ширина = 23;
			Элементы.РегистрационныйНомер.Видимость = Ложь;
			Элементы.НадписьРегистрационныйНомер.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Формирует запрос активации программного ключа
&НаКлиенте
Функция СформироватьЗапросАктивации()
	
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);
	
	ТекстXML = Новый ЗаписьXML;
	ТекстXML.УстановитьСтроку();
	
	ТекстXML.ЗаписатьОбъявлениеXML();
	ТекстXML.ЗаписатьНачалоЭлемента("sd");
	
	ТекстXML.ЗаписатьНачалоЭлемента("Activation");
	
	Если РежимАктивации = 0 Тогда
		ТекстXML.ЗаписатьАтрибут("Type", "0");
		
		ТекстXML.ЗаписатьАтрибут("PinCode", Объект.ПинКод);
		ТекстXML.ЗаписатьАтрибут("Regnumber", Объект.РегистрационныйНомер);
		
	Иначе
		ТекстXML.ЗаписатьАтрибут("Type", "2");
		ТекстXML.ЗаписатьАтрибут("PinCode", Объект.ПинКод);
		ТекстXML.ЗаписатьАтрибут("Regnumber", "");
	КонецЕсли;
	
	ТекстXML.ЗаписатьАтрибут("Signature", Объект.СигнатураОборудования);
	ТекстXML.ЗаписатьАтрибут("HIDText", Объект.ОписаниеОборудования);
	
	ТекстXML.ЗаписатьКонецЭлемента();
	
	ТекстXML.ЗаписатьНачалоЭлемента("RegInfo");
	
	ТекстXML.ЗаписатьАтрибут("Responsible", Объект.Ответственный);
	ТекстXML.ЗаписатьАтрибут("Organization", Объект.Организация);
	ТекстXML.ЗаписатьАтрибут("Phone", Объект.Телефон);
	ТекстXML.ЗаписатьАтрибут("email", Объект.ЭлектроннаяПочта);
	ТекстXML.ЗаписатьАтрибут("web", Объект.Сайт);
	ТекстXML.ЗаписатьАтрибут("installer", Объект.Установщик);
	
	ТекстXML.ЗаписатьКонецЭлемента();
	ТекстXML.ЗаписатьКонецЭлемента();
	
	СтрокаАктивации = ТекстXML.Закрыть();
		
    КодированнаяСтрока = "";
	ОписаниеОшибки="";
	Если НЕ ЛицензированиеСервер.сплЗакодироватьСтроку(СтрокаАктивации, КодированнаяСтрока, ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;

	Возврат КодированнаяСтрока;
КонецФункции

// Формирует запрос телефонной активации программного ключа
&НаКлиенте
Функция СформироватьЗапросТелефоннойАктивации()
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);

	Если РежимАктивации = 0 Тогда
		СерийныйНомер = ЛицензированиеСервер.НомерПродуктаИзСерийногоНомера(Объект.РегистрационныйНомер);
	Иначе
		СерийныйНомер = 0;
	КонецЕсли;
	
	НомерЛинейкиПродуктов = ЛицензированиеСервер.ИдентификаторПродукта(ИмяМакетаПараметровЛицензирования);
	ПинКод = Объект.ПинКод;
	ИдАппаратнойПривязки = Объект.СигнатураОборудования;
	Результат = "";
	
	Если ЛицензированиеСервер.ПолучитьТелефонныйЗапрос(СерийныйНомер, НомерЛинейкиПродуктов, ПинКод, ИдАппаратнойПривязки, Результат, ОписаниеОшибки) Тогда
		Возврат Результат;
	Иначе
		Сообщить(ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура АдресСервераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокСерверов = СписокСерверов(ОписаниеОшибки);
	ВыбранныйЭлемент = СписокСерверов.ВыбратьЭлемент("Выберите сервер лицензирования");
	Объект.АдресСервера = ?(ВыбранныйЭлемент = Неопределено, Объект.АдресСервера, ВыбранныйЭлемент.Значение);
КонецПроцедуры

//Возвращает список серверов лицензирования, найденных в локальной сети  
&НаСервереБезКонтекста
Функция СписокСерверов(ОписаниеОшибки)
	Возврат ЛицензированиеСервер.ПолучитьСписокСерверов("",ОписаниеОшибки);
КонецФункции

&НаКлиенте
Процедура РежимСтартаПриИзменении(Элемент)
	Если Объект.РежимСтарта = 0 Тогда
		Объект.АдресСервера = "*LOCAL";
		Элементы.АдресСервера.Доступность = Ложь;
		Элементы.ПодключитьсяКВыбранномуСерверуПослеАктивации.Доступность = Ложь;
		Объект.ПодключитьсяКВыбранномуСерверуПослеАктивации = Ложь;
	Иначе
		Элементы.АдресСервера.Доступность = Истина;
		Элементы.ПодключитьсяКВыбранномуСерверуПослеАктивации.Доступность = Истина;
		Объект.ПодключитьсяКВыбранномуСерверуПослеАктивации = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаАктивацияВебСервис Тогда
		ТекущийАдрес = ЛицензированиеСервер.АдресСервераЛицензирования();
		АдресАктивации = Объект.АдресСервера;
		
		Если (НЕ ЗначениеЗаполнено(ТекущийАдрес) ИЛИ ВРег(ТекущийАдрес) = "*LOCAL" ИЛИ ВРег(ТекущийАдрес) = "LOCALHOST") И
			(НЕ ЗначениеЗаполнено(АдресАктивации) ИЛИ ВРег(АдресАктивации) = "*LOCAL" ИЛИ ВРег(АдресАктивации) = "LOCALHOST") Тогда
			
		Иначе
			Текст = "Адрес текущего сервера лицензирования: "+ ТекущийАдрес + 
			        "|Адрес выбранного сервера для активации ключа: " + АдресАктивации;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СервераРазличаются()
	ТекущийАдрес = ЛицензированиеСервер.АдресСервераЛицензирования();
	АдресАктивации = Объект.АдресСервера;
	
	Если НЕ ВРЕГ(ТекущийАдрес) = ВРЕГ(АдресАктивации) Тогда
		Возврат Истина;
	ИначеЕсли (ВРег(ТекущийАдрес) = "*LOCAL" ИЛИ ВРег(ТекущийАдрес) = "LOCALHOST") И (ВРег(АдресАктивации) = "*LOCAL" ИЛИ ВРег(АдресАктивации) = "LOCALHOST") Тогда
		Возврат Ложь;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	Если ВРег(Настройки["Объект.АдресСервера"]) = "*AUTO" Тогда
		Настройки["Объект.АдресСервера"] = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершитьРаботуМастера(Команда)
	Если Объект.ПодключитьсяКВыбранномуСерверуПослеАктивации Тогда
		ЛицензированиеСервер.УстановитьАдресСервераЛицензирования(Объект.АдресСервера);
		Оповестить("СерверЛицензирования",Объект.АдресСервера);
	КонецЕсли;
	ЭтаФорма.Закрыть(ОписаниеОшибки);
КонецПроцедуры

&НаКлиенте
Процедура БлокОтветаТелефоннойАктивации1ПриИзменении(Элемент)
	
	ПроверитьСтрокуДанныхТелефоннойАктивации(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокОтветаТелефоннойАктивации1АвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ПроверитьСтрокуДанныхТелефоннойАктивации(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтрокуДанныхТелефоннойАктивации(Элемент)
	СтрокаАктивации = Элемент.ТекстРедактирования;
	Результат = ЛицензированиеСервер.ПроверитьСтрокуДанныхТелефоннойАктивации(СтрокаАктивации, ОписаниеОшибки);
	Если Результат = Неопределено Тогда
		Сообщить(ОписаниеОшибки);
	КонецЕсли;
	
	Если НЕ Результат Тогда
		Элементы[Элемент.Имя].ЦветТекста = WebЦвета.Красный;
	Иначе
		Элементы[Элемент.Имя].ЦветТекста = WebЦвета.Зеленый;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	СохранитьНастройки();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	ОписаниеНастройки = Новый ОписаниеНастроек;
	ОписаниеНастройки.Представление = "Регистрационная информация";
	ДанныеНастройки = Новый Структура("Организация, Ответственный, Телефон, ЭлектроннаяПочта, Сайт, Установщик", Объект.Организация, Объект.Ответственный, Объект.Телефон, Объект.ЭлектроннаяПочта, Объект.Сайт, Объект.Установщик);
	ХранилищеОбщихНастроек.Сохранить("РегистрационнаяИнформация",,ДанныеНастройки,,"");
КонецПроцедуры
